{"backend": "tensorflow", "config": [{"config": {"input_length": 130, "batch_input_shape": [null, 130], "embeddings_constraint": null, "name": "embedding_4", "dtype": "float32", "input_dim": 500, "activity_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "output_dim": 128, "mask_zero": false, "trainable": true}, "class_name": "Embedding"}, {"config": {"name": "spatial_dropout1d_4", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.7}, "class_name": "SpatialDropout1D"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "return_state": false, "recurrent_regularizer": null, "name": "lstm_4", "kernel_regularizer": null, "unit_forget_bias": true, "trainable": true, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "return_sequences": false, "activity_regularizer": null, "stateful": false, "recurrent_dropout": 0.7, "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "dropout": 0.7, "kernel_constraint": null, "units": 64, "activation": "tanh", "unroll": false, "recurrent_constraint": null, "implementation": 1, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "name": "dense_4", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 4, "kernel_constraint": null, "trainable": true, "activation": "softmax"}, "class_name": "Dense"}], "keras_version": "2.1.3", "class_name": "Sequential"}